itworks/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);// to be completed

boundaryField
{
allBoundary
{
  type		fixedValue;
  value 	uniform (0 0 0);

}
inlet
{

  type		fixedValue;
  value 	uniform (0 0 4);
}

box
{
  type		fixedValue;
  value 	uniform (0 0 0);
}
//outlet
//{
//  type		zeroGradient;
//}
//thermal
//{
//  type		fixedValue;
 // value 	uniform (0 0 0);
//}
ceiling
{
  type     zeroGradient;

}
}

// ************************************************************************* //

